workWithClint/TestCaseFSI/solid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(	
    (9 0 0)
    (10 0 0)
    (10 8 0)
    (9 8 0)
    (9 0 0.1)
    (10 0 0.1)
    (10 8 0.1)
    (9 8 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (1 8 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
